In [1]:
import pandas as pd
import numpy as np

# Ordinal Data

In [2]:
df = pd.read_csv('customer.csv')

In [3]:
df.sample(5)

    age  gender   review education purchased
38   45  Female     Good    School        No
8    65  Female  Average        UG        No
45   61    Male     Poor        PG       Yes
9    74    Male     Good        UG       Yes
15   75    Male     Poor        UG        No

In [4]:
df = df.iloc[:,2:]

In [5]:
df.head()

    review education purchased
0  Average    School        No
1     Poor        UG        No
2     Good        PG        No
3     Good        PG        No
4  Average        UG        No

In [6]:
from sklearn.preprocessing import OrdinalEncoder

In [7]:
from sklearn.model_selection import train_test_split

In [8]:
x_train,x_test,y_train,y_test=train_test_split(df.iloc[:,0:2],df.iloc[:,-1],test_size=0.2)

In [9]:
x_train.head()

   review education
38   Good    School
36   Good        UG
11   Good        UG
48   Good        UG
6    Good    School

In [10]:
oe = OrdinalEncoder(categories=[['Poor','Average','Good'],['School','UG','PG']])

In [11]:
oe.fit(x_train)

OrdinalEncoder(categories=[['Poor', 'Average', 'Good'], ['School', 'UG', 'PG']])

In [12]:
x_train = oe.transform(x_train)

In [13]:
x_train

array([[2., 0.],
       [2., 1.],
       [2., 1.],
       [2., 1.],
       [2., 0.],
       [2., 2.],
       [1., 1.],
       [2., 0.],
       [1., 1.],
       [0., 2.],
       [1., 1.],
       [1., 0.],
       [0., 2.],
       [2., 0.],
       [0., 2.],
       [0., 0.],
       [0., 1.],
       [2., 2.],
       [2., 1.],
       [0., 2.],
       [0., 2.],
       [0., 1.],
       [1., 2.],
       [0., 0.],
       [2., 2.],
       [0., 0.],
       [1., 1.],
       [2., 1.],
       [1., 2.],
       [2., 1.],
       [2., 0.],
       [2., 2.],
       [0., 1.],
       [1., 0.],
       [1., 2.],
       [0., 2.],
       [2., 2.],
       [1., 1.],
       [1., 0.],
       [1., 0.]])

In [14]:
x_test = oe.transform(x_test)

In [15]:
oe.categories_

[array(['Poor', 'Average', 'Good'], dtype=object),
 array(['School', 'UG', 'PG'], dtype=object)]

In [16]:
from sklearn.preprocessing import LabelEncoder

In [17]:
le=LabelEncoder()

In [18]:
le.fit(y_train)

LabelEncoder()

In [19]:
le.classes_

array(['No', 'Yes'], dtype=object)

In [20]:
y_train = le.fit_transform(y_train)
y_test = le.fit_transform(y_test)

In [21]:
y_train #yes=1,0=No

array([0, 1, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0,
       1, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0])

# Nominal Data

In [22]:
cars=pd.read_csv('cars.csv')

In [23]:
cars.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

one hot encoding

In [24]:
cars['brand'].value_counts()

Maruti           2448
Hyundai          1415
Mahindra          772
Tata              734
Toyota            488
Honda             467
Ford              397
Chevrolet         230
Renault           228
Volkswagen        186
BMW               120
Skoda             105
Nissan             81
Jaguar             71
Volvo              67
Datsun             65
Mercedes-Benz      54
Fiat               47
Audi               40
Lexus              34
Jeep               31
Mitsubishi         14
Force               6
Land                6
Isuzu               5
Ambassador          4
Kia                 4
Daewoo              3
MG                  3
Peugeot             1
Ashok               1
Opel                1
Name: brand, dtype: int64

In [25]:
cars['brand'].nunique()

32

In [26]:
cars['fuel'].value_counts()

Diesel    4402
Petrol    3631
CNG         57
LPG         38
Name: fuel, dtype: int64

In [27]:
pd.get_dummies(cars,columns=['fuel','owner'])

,brand,km_driven,selling_price,fuel_CNG,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_First Owner,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,0,1,0,0,1,0,0,0,0
1,Skoda,120000,370000,0,1,0,0,0,0,1,0,0
2,Honda,140000,158000,0,0,0,1,0,0,0,0,1
3,Hyundai,127000,225000,0,1,0,0,1,0,0,0,0
4,Maruti,120000,130000,0,0,0,1,1,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
8123,Hyundai,110000,320000,0,0,0,1,1,0,0,0,0
8124,Hyundai,119000,135000,0,1,0,0,0,1,0,0,0
8125,Maruti,120000,382000,0,1,0,0,1,0,0,0,0
8126,Tata,25000,290000,0,1,0,0,1,0,0,0,0
8127,Tata,25000,290000,0,1,0,0,1,0,0,0,0

K-1 one hot Encoding

In [28]:
pd.get_dummies(cars,columns=['fuel','owner'],drop_first=True)

,brand,km_driven,selling_price,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,1,0,0,0,0,0,0
1,Skoda,120000,370000,1,0,0,0,1,0,0
2,Honda,140000,158000,0,0,1,0,0,0,1
3,Hyundai,127000,225000,1,0,0,0,0,0,0
4,Maruti,120000,130000,0,0,1,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...
8123,Hyundai,110000,320000,0,0,1,0,0,0,0
8124,Hyundai,119000,135000,1,0,0,1,0,0,0
8125,Maruti,120000,382000,1,0,0,0,0,0,0
8126,Tata,25000,290000,1,0,0,0,0,0,0
8127,Tata,25000,290000,1,0,0,0,0,0,0

We don't use Pandas for one hot encoding during project because it doesnot remember the position where it put a particular column which result in ambiguity in data.so we use scikit learn library one hot encoder.

In [29]:
x_train,x_test,y_train,y_test = train_test_split(cars.iloc[:,0:4],cars.iloc[:,-1],test_size=0.2,random_state=0)

In [30]:
x_train.head()

         brand  km_driven    fuel         owner
3042   Hyundai      60000     LPG   First Owner
1520      Tata     150000  Diesel   Third Owner
2611   Hyundai     110000  Diesel  Second Owner
3544  Mahindra      28000  Diesel  Second Owner
4138    Maruti      15000  Petrol   First Owner

In [31]:
from sklearn.preprocessing import OneHotEncoder

In [37]:
ohe = OneHotEncoder(drop='first',sparse=False,dtype=np.int32)

In [38]:
x_train_new = ohe.fit_transform(x_train[['fuel','owner']])
x_test_new = ohe.fit_transform(x_test[['fuel','owner']])

In [39]:
np.hstack((x_train[['brand','km_driven']].values,x_train_new)).shape

(6502, 9)

# onehot encoding with top categories

In [41]:
counts = cars['brand'].value_counts()

In [42]:
cars['brand'].nunique()
threshold = 100

In [43]:
repl = counts[counts <= threshold].index

In [44]:
pd.get_dummies(cars['brand'].replace(repl,"others"))

,BMW,Chevrolet,Ford,Honda,Hyundai,Mahindra,Maruti,Renault,Skoda,Tata,Toyota,Volkswagen,others
0,0,0,0,0,0,0,1,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,1,0,0,0,0
2,0,0,0,1,0,0,0,0,0,0,0,0,0
3,0,0,0,0,1,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,1,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
8123,0,0,0,0,1,0,0,0,0,0,0,0,0
8124,0,0,0,0,1,0,0,0,0,0,0,0,0
8125,0,0,0,0,0,0,1,0,0,0,0,0,0
8126,0,0,0,0,0,0,0,0,0,1,0,0,0
8127,0,0,0,0,0,0,0,0,0,1,0,0,0

# Column Tansformer

In [45]:
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import OrdinalEncoder

In [46]:
df = pd.read_csv("covid_toy.csv")

In [47]:
df.head()

   age  gender  fever cough     city has_covid
0   60    Male  103.0  Mild  Kolkata        No
1   27    Male  100.0  Mild    Delhi       Yes
2   42    Male  101.0  Mild    Delhi        No
3   31  Female   98.0  Mild  Kolkata        No
4   65  Female  101.0  Mild   Mumbai        No

In [48]:
df['cough'].value_counts()

Mild      62
Strong    38
Name: cough, dtype: int64

In [49]:
df['city'].value_counts()

Kolkata      32
Bangalore    30
Delhi        22
Mumbai       16
Name: city, dtype: int64

In [50]:
df.shape

(100, 6)

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        100 non-null    int64
 1   gender     100 non-null    object
 2   fever      90 non-null     float64
 3   cough      100 non-null    object
 4   city       100 non-null    object
 5   has_covid  100 non-null    object
dtypes: float64(1), int64(1), object(4)
memory usage: 4.8+ KB

In [53]:
df.isnull().sum()

age           0
gender        0
fever        10
cough         0
city          0
has_covid     0
dtype: int64

In [54]:
x_train,x_test,y_train,y_test = train_test_split(df.drop(columns=['has_covid']),df['has_covid'],test_size=0.2)

In [55]:
x_train

    age  gender  fever   cough       city
10   75  Female    NaN    Mild      Delhi
35   82  Female  102.0  Strong  Bangalore
28   16    Male  104.0    Mild    Kolkata
66   51    Male  104.0    Mild    Kolkata
27   33  Female  102.0  Strong      Delhi
..  ...     ...    ...     ...        ...
84   69  Female   98.0  Strong     Mumbai
97   20  Female  101.0    Mild  Bangalore
46   19  Female  101.0    Mild     Mumbai
48   66    Male   99.0  Strong  Bangalore
2    42    Male  101.0    Mild      Delhi

[80 rows x 5 columns]

# Without Colum transformer

In [58]:
si = SimpleImputer()
x_train_fever = si.fit_transform(x_train[['fever']]) 
x_test_fever = si.fit_transform(x_test[['fever']])

In [60]:
x_train_fever.shape

(80, 1)

In [63]:
# ordinal Encoding -> cough
oe = OrdinalEncoder(categories=[['Mild','Strong']])
x_train_cough = oe.fit_transform(x_train[['cough']])

x_test_cough = oe.fit_transform(x_test[['cough']])

In [66]:
x_train_cough.shape

(80, 1)

In [69]:
# OneHotEncoding -> city,gender
ohe = OneHotEncoder(drop='first',sparse=False)
x_train_gender_city = ohe.fit_transform(x_train[['gender','city']])
x_test_gender_city = ohe.fit_transform(x_test[['gender','city']])
x_train_gender_city.shape

(80, 4)

In [70]:
#Extracting age
x_train_age =x_train.drop(columns=['gender','fever','cough','city']).values
x_test_age =x_test.drop(columns=['gender','fever','cough','city']).values

In [72]:
x_train_transformed = np.concatenate((x_train_age,x_train_fever,x_train_gender_city,x_train_cough),axis=1)
x_test_transformed = np.concatenate((x_test_age,x_test_fever,x_test_gender_city,x_test_cough),axis=1)

In [76]:
x_train_transformed.shape

(80, 7)

# With Colum transformer

In [77]:
from sklearn.compose import ColumnTransformer

In [84]:
ct = ColumnTransformer(transformers=[
    ('ct1',SimpleImputer(),['fever']),
    ('ct2',OrdinalEncoder(categories=[['Mild','Strong']]),['cough']),
    ('ct3',OneHotEncoder(sparse=False,drop='first'),['gender','city'])
],remainder='passthrough')

In [86]:
new_x_train = ct.fit_transform(x_train)

In [88]:
new_x_train = ct.fit_transform(x_test)